app/controllers/leads_controller.rb

SELECT `leads`.* FROM `leads`
---
  def index
    @leads = Lead.all

INSERT INTO `leads` (`full_name`, `company_name`, `email`, `phone_number`, `project_name`, `project_description`, `department_in_charge`, `message`, `created_at`, `updated_at`) VALUES ('Marc-Antoine Tanguay', 'Bad Company', 'marc_ant21@hotmail.com', '4182153301', 'Big Bad Project', 'lakdwkdfnenbfoeb  nfe nnine fein pin penefn', 'Marketing', 'cecnein  ine fin ', '2019-03-13 00:47:20', '2019-03-13 00:47:20')
---
  def create
    @lead = Lead.new(lead_params)

    # #ADDED FOLLOWING CODE TO TRY TO SOLVE THE O'HARA PROBLEMS
    # if @lead.full_name.include? "'"
    #   sentence["'"] = " "
    # end
    #   #ADDED THE UPPER LINES TO TRY AND SOLVE THE O'HARA PROBLEM ... still not working


    @customer = Customer.find_by company_name: params[:lead][:company_name]
    if @customer != nil
        @lead.customer_id = @customer.id
    else @lead.customer_id = nil
    respond_to do |format|
      if @lead.save