app/controllers/quotes_controller.rb

  def index
    @quotes = Quote.all
---
SELECT `quotes`.* FROM `quotes`

    end

    respond_to do |format|
      if @quote.save
---
INSERT INTO `quotes` (`full_name`, `company_name`, `email`, `phone_number`, `created_at`, `updated_at`) VALUES ('Felix', '', '', '', '2019-03-07 19:36:01', '2019-03-07 19:36:01')

    def set_quote
      @quote = Quote.find(params[:id])
---
SELECT  `quotes`.* FROM `quotes` WHERE `quotes`.`id` = 19 LIMIT 1